Documents/ESB/ESB_Consumer_0916/003TestSample/SAMPLE_XML_MUST/DebitCard/DC05_DbCardLmtModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DebitCard/DbCardLmtModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardLmtMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardLmtModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC05</v11:TxnId>  
        <v11:TxnNo>DC0500001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>5211958800000591</v11:CardNo>  
        <v11:DayLmt>100000</v11:DayLmt>  
        <v11:MnthLmt>99999999</v11:MnthLmt>  
        <!--Optional:-->  
        <v11:TempDDLmt>100</v11:TempDDLmt>  
        <!--Optional:-->  
        <v11:StartTempDDLmtDate>20180201</v11:StartTempDDLmtDate>  
        <!--Optional:-->  
        <v11:EndTempDDLmtDate>20180228</v11:EndTempDDLmtDate>  
        <!--Optional:-->  
        <v11:TempMMLmt>1000</v11:TempMMLmt>  
        <!--Optional:-->  
        <v11:StartTempMMLmtDate>201802</v11:StartTempMMLmtDate>  
        <!--Optional:-->  
        <v11:EndTempMMLmtDate>201803</v11:EndTempMMLmtDate>  
        <v11:UpdDate>20180125</v11:UpdDate>  
        <v11:UpdTime>093800</v11:UpdTime>  
        <v11:UpdtUserId>1547</v11:UpdtUserId> 
      </v11:ServiceBody> 
    </v11:DbCardLmtModRq> 
  </soap:Body> 
</soap:Envelope>
